{
    "spelling": [
        "/bəˈnænə/"
    ],
    "synonyms": [
        "plantain",
        "gagman",
        "pineapple",
        "coconut",
        "melon"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The definition of a banana is a plant grown in tropical regions, or the fruit which it bears.",
            "vi": "Định nghĩa về chuối là một loại thực vật được trồng ở các vùng nhiệt đới, hoặc trái cây mà nó mang lại."
        },
        {
            "pos": "adjective",
            "en": "Curved like a banana, especially of a ball in flight.",
            "vi": "Cong như một quả chuối, đặc biệt là của một quả bóng đang bay."
        },
        {
            "pos": "acronym",
            "en": "Build Absolutely Nothing Anywhere Near Anyone () Anything. Someone who objects to the building of any structure in their neighborhood, especially in public policy debate. Used as an expression of irritation towards people who are thought of as being worse than NIMBYs.",
            "vi": "Xây dựng hoàn toàn không có gì bất cứ nơi nào gần bất kỳ ai () Bất cứ điều gì. Một người nào đó phản đối việc xây dựng bất kỳ công trình kiến ​​trúc nào trong khu phố của họ, đặc biệt là trong các cuộc tranh luận về chính sách công. Được sử dụng như một biểu hiện của sự khó chịu đối với những người được cho là tồi tệ hơn NIMBYs."
        }
    ],
    "sentences": [
        {
            "en": "While Dean stretched his muscles and alternated between bites of peanut butter sandwich and a banana, Fred perused the rest of the master lists.",
            "vi": "Trong khi Dean căng cơ và xen kẽ giữa những miếng bánh mì kẹp bơ đậu phộng và một quả chuối, Fred đọc kỹ phần còn lại của danh sách tổng thể."
        },
        {
            "en": "The jasmine, almond, banana, cork and coco-nut palm are among the trees.",
            "vi": "Hoa nhài, hạnh nhân, chuối, bần và dừa hạt cọ nằm trong số các cây."
        }
    ],
    "words_form": [
        "bananas"
    ],
    "meaning_vi": "trái chuối"
}