{
    "spelling": [
        "/bɛst/"
    ],
    "synonyms": [
        "optimum",
        "foremost",
        "greater",
        "supreme",
        "greatest"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "The definition of best is better than all others.",
            "vi": "Định nghĩa tốt nhất là tốt hơn tất cả những định nghĩa khác."
        },
        {
            "pos": "noun",
            "en": "Best is defined as the greatest degree or highest efforts.",
            "vi": "Tốt nhất được định nghĩa là mức độ lớn nhất hoặc nỗ lực cao nhất."
        },
        {
            "pos": "adverb",
            "en": "Best means in the greatest advantage or manner.",
            "vi": "Tốt nhất có nghĩa là lợi thế hoặc cách thức lớn nhất."
        },
        {
            "pos": "verb",
            "en": "To get the better of; beat.",
            "vi": "Để có được tốt hơn của; đánh đập."
        },
        {
            "pos": "anagrams",
            "en": "Bets.",
            "vi": "Cược."
        },
        {
            "pos": "pronoun",
            "en": "A surname.",
            "vi": "Họ."
        },
        {
            "pos": "idiom",
            "en": "at best  Interpreted most favorably; at the most: No more than 40 people at best in attendance.Under the most favorable conditions: Has a top speed of 20 miles per hour at best.",
            "vi": "tốt nhất được thông dịch thuận lợi nhất; Tối đa: Không quá 40 người tham dự. Theo điều kiện thuận lợi nhất: Có tốc độ tối đa 20 dặm / giờ."
        }
    ],
    "sentences": [
        {
            "en": "Betsy and Martha, now practically best friends, conspired together against the rest of us until they owned most of the board.",
            "vi": "Betsy và Martha, thực tế là bạn thân của nhau, đã cùng nhau âm mưu chống lại chúng tôi cho đến khi họ sở hữu phần lớn hội đồng quản trị."
        },
        {
            "en": "The best works of art are the expression of man's struggle to free himself from this condition, but the effect of our art is merely to make this low state comfortable and that higher state to be forgotten.",
            "vi": "Những tác phẩm nghệ thuật hay nhất là sự thể hiện cuộc đấu tranh của con người để giải phóng bản thân khỏi tình trạng này, nhưng tác dụng của nghệ thuật của chúng ta chỉ là làm cho trạng thái thấp này trở nên thoải mái và trạng thái cao hơn đó bị lãng quên."
        }
    ],
    "words_form": [
        "bested",
        "bests"
    ],
    "meaning_vi": "tốt"
}