{
    "spelling": [
        "/kənˈsɛpʃən/"
    ],
    "synonyms": [
        "appreciation",
        "conceit",
        "concept",
        "impression",
        "interpretation"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The act, process, or power of conceiving mentally; formulation of ideas, esp. of abstractions.",
            "vi": "Một thứ gì đó, chẳng hạn như tiền, được cho hoặc nhận dưới dạng thanh toán hoặc đền bù, như cho một dịch vụ hoặc tổn thất."
        },
        {
            "pos": "",
            "en": "The formation of a zygote resulting from the union of a sperm and egg cell; fertilization.",
            "vi": "Thanh toán vào một số thời điểm đã thỏa thuận trong tương lai cho công việc đã hoàn thành."
        }
    ],
    "sentences": [
        {
            "en": "Yet Carmen insisted that any artificial method of conception was sinful – playing God.",
            "vi": "Tuy nhiên, Carmen khẳng định rằng bất kỳ phương pháp thụ thai nhân tạo nào đều là tội lỗi - đóng vai Chúa."
        },
        {
            "en": "First there were the natural sciences, themselves only just emerging from a confused conception of their true method; especially those which studied the borderland of physical and mental phenomena, the medical sciences; and pre-eminently that science which has since become so popular, the science of biology.",
            "vi": "Đầu tiên là các khoa học tự nhiên, bản thân chúng chỉ mới xuất hiện từ một quan niệm bối rối về phương pháp thực sự của chúng; đặc biệt là những nghiên cứu về vùng biên giới của các hiện tượng vật lý và tinh thần, khoa học y tế; và nổi bật hơn cả là khoa học mà từ đó đã trở nên rất phổ biến, khoa học sinh học."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "The act, process, or power of conceiving mentally; formulation of ideas, esp. of abstractions.",
            "vi": "Một thứ gì đó, chẳng hạn như tiền, được cho hoặc nhận dưới dạng thanh toán hoặc đền bù, như cho một dịch vụ hoặc tổn thất."
        },
        {
            "pos": "",
            "en": "The formation of a zygote resulting from the union of a sperm and egg cell; fertilization.",
            "vi": "Thanh toán vào một số thời điểm đã thỏa thuận trong tương lai cho công việc đã hoàn thành."
        }
    ]
}