{
    "spelling": [
        "/kɒŋˈgrɛʃənl/"
    ],
    "synonyms": [
        "parliamentary",
        "senatorial",
        "decreeing",
        "enacting",
        "jurisdictive"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Of or relating to a congress.",
            "vi": "Sự sắp xếp của các bộ phận hoặc nguyên tố theo một mô hình hoặc hình thức, như: (hóa học) Sự sắp xếp cấu trúc của các nguyên tử trong một hợp chất hoặc phân tử. (máy tính) Cách thức mà hệ thống máy tính hoặc mạng được thiết lập hoặc kết nối. (tâm lý học) Gestalt."
        },
        {
            "pos": "noun",
            "en": "A member of a congress.",
            "vi": "Cấu trúc của một hệ thống. Để \"cấu hình phần mềm\" có nghĩa là chọn các tùy chọn có thể lập trình làm cho chương trình hoạt động theo ý muốn của người dùng. Để \"cấu hình phần cứng\" có nghĩa là lắp ráp các thành phần mong muốn cho một hệ thống tùy chỉnh cũng như lựa chọn các tùy chọn trong các phần có thể lập trình của người dùng của hệ thống. \"Khả năng cấu hình\" đề cập đến khả năng thay đổi và tùy chỉnh của phần cứng hoặc phần mềm. Xem cài đặt."
        }
    ],
    "sentences": [
        {
            "en": "On the 21st of July the Fourteenth Amendment was ratified, and a section of the state constitution (which denied the power of state courts to entertain against any resident of the state suits founded on contracts existing on the 15th of June 1865) was repealed by the legislature in pursuance of the congressional \" Omnibus Bill \" of the 25th of June 1868, and as evidence of the restoration of Georgia to the Union the congressmen were seated on the 25th of July in that year.",
            "vi": "Vào ngày 21 tháng 7, Tu chính án thứ mười bốn đã được phê chuẩn và một phần của hiến pháp tiểu bang (vốn từ chối quyền của các tòa án tiểu bang được giải quyết chống lại bất kỳ cư dân của tiểu bang nào dựa trên các hợp đồng tồn tại vào ngày 15 tháng 6 năm 1865) đã bị bãi bỏ bởi cơ quan lập pháp theo đuổi \"Dự luật Omnibus\" của quốc hội ngày 25 tháng 6 năm 1868, và để làm bằng chứng về việc Georgia trở lại Liên minh, các dân biểu đã ngồi vào ngày 25 tháng 7 trong năm đó."
        },
        {
            "en": "He called for a congressional investigation.",
            "vi": "Ông kêu gọi một cuộc điều tra của Quốc hội."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "adjective",
            "en": "Of or relating to a congress.",
            "vi": "Sự sắp xếp của các bộ phận hoặc nguyên tố theo một mô hình hoặc hình thức, như: (hóa học) Sự sắp xếp cấu trúc của các nguyên tử trong một hợp chất hoặc phân tử. (máy tính) Cách thức mà hệ thống máy tính hoặc mạng được thiết lập hoặc kết nối. (tâm lý học) Gestalt."
        },
        {
            "pos": "noun",
            "en": "A member of a congress.",
            "vi": "Cấu trúc của một hệ thống. Để \"cấu hình phần mềm\" có nghĩa là chọn các tùy chọn có thể lập trình làm cho chương trình hoạt động theo ý muốn của người dùng. Để \"cấu hình phần cứng\" có nghĩa là lắp ráp các thành phần mong muốn cho một hệ thống tùy chỉnh cũng như lựa chọn các tùy chọn trong các phần có thể lập trình của người dùng của hệ thống. \"Khả năng cấu hình\" đề cập đến khả năng thay đổi và tùy chỉnh của phần cứng hoặc phần mềm. Xem cài đặt."
        }
    ]
}