{
    "spelling": [
        "/kɔr/"
    ],
    "synonyms": [
        "center",
        "heart",
        "discrete",
        "focus",
        "kernel"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A set of subjects or courses that make up a required portion of a curriculum.",
            "vi": "Một tập hợp các môn học hoặc khóa học tạo nên một phần bắt buộc của chương trình giảng dạy."
        },
        {
            "pos": "adjective",
            "en": "Core is defined as the most important or main thing.",
            "vi": "Cốt lõi được định nghĩa là điều quan trọng nhất hoặc chính."
        },
        {
            "pos": "verb",
            "en": "Core is defined as to remove the seeds and fibrous insides of fruit.",
            "vi": "Lõi được định nghĩa là loại bỏ hạt và xơ bên trong của quả."
        },
        {
            "pos": "abbreviation",
            "en": "Congress of Racial Equality.",
            "vi": "Đại hội bình đẳng chủng tộc."
        },
        {
            "pos": "pronoun",
            "en": "(Greek mythology) The birth name of Persephone/Proserpina, the queen of the Underworld/Hades, and goddess of the seasons and of vegetation. She is the daughter of Zeus and Demeter; and the wife of Hades.",
            "vi": "(Thần thoại Hy Lạp) Tên khai sinh của Persephone / Proserpina, nữ hoàng của Underworld / Hades, nữ thần của các mùa và thảm thực vật. Cô là con gái của Zeus và Demeter; và vợ của Hades."
        },
        {
            "pos": "suffix",
            "en": "Applied to various (often specialised and underground) genres of music.",
            "vi": "Áp dụng cho nhiều thể loại âm nhạc (thường là chuyên biệt và underground)."
        }
    ],
    "sentences": [
        {
            "en": "The sense of peace and calm at his core returned as her energy flowed through him.",
            "vi": "Cảm giác bình yên và tĩnh lặng trong tâm anh trở lại khi năng lượng của cô chảy qua anh."
        },
        {
            "en": "The earth has an enormous molten core that contains vast amounts of energy.",
            "vi": "Trái đất có một lõi nóng chảy khổng lồ chứa một lượng lớn năng lượng."
        }
    ],
    "words_form": [
        "cored",
        "cores",
        "coring"
    ],
    "meaning_vi": "lõi"
}