{
    "spelling": [
        "/ˈdæmɪʤɪŋ/"
    ],
    "synonyms": [
        "detrimental",
        "harmful",
        "injurious",
        "prejudicial",
        "ruinous"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Harmful; injurious; causing damage.",
            "vi": "Một tàu thám hiểm sao Hỏa được NASA phóng vào ngày 26 tháng 11 năm 2011 và hạ cánh xuống Miệng núi lửa Gale vào ngày 6 tháng 8 năm 2012."
        },
        {
            "pos": "verb",
            "en": "Present participle of damage.",
            "vi": "Một bộ phận, chẳng hạn như thân, lá hoặc rễ, được lấy ra khỏi cây để nhân giống cây mới, bằng cách tạo rễ hoặc ghép."
        }
    ],
    "sentences": [
        {
            "en": "Moreover, the very fact of being under the protection and, as it were, in the pay of an absolute monarch was damaging to the character of their literature.",
            "vi": "Hơn nữa, thực tế là dưới sự bảo vệ và, như vậy, trong sự trả thù của một vị vua tuyệt đối đã làm tổn hại đến đặc trưng của nền văn học của họ."
        },
        {
            "en": "But Mr Gladstone's influence with the Liberal party was paramount, in spite of the damaging appearance of the compact made with Parnell, and Forster's pointed criticisms only caused thoroughgoing partisans to accuse him of a desire to avenge himself.",
            "vi": "Nhưng ảnh hưởng của ông Gladstone với đảng Tự do là tối quan trọng, bất chấp vẻ ngoài hư hại của chiếc đầm được làm từ Parnell, và những lời chỉ trích thẳng thắn của Forster chỉ khiến những người theo đảng triệt để buộc tội ông muốn trả thù cho bản thân."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "adjective",
            "en": "Harmful; injurious; causing damage.",
            "vi": "Một tàu thám hiểm sao Hỏa được NASA phóng vào ngày 26 tháng 11 năm 2011 và hạ cánh xuống Miệng núi lửa Gale vào ngày 6 tháng 8 năm 2012."
        },
        {
            "pos": "verb",
            "en": "Present participle of damage.",
            "vi": "Một bộ phận, chẳng hạn như thân, lá hoặc rễ, được lấy ra khỏi cây để nhân giống cây mới, bằng cách tạo rễ hoặc ghép."
        }
    ]
}