{
    "spelling": [
        "/ˈdaɪ(ə)mənd/"
    ],
    "synonyms": [
        "crystal",
        "gem",
        "brilliant",
        "jewel",
        "sparkler"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A diamond is defined as a colorless, very hard, crystalline mineral made of pure carbon, or a figure with four equal sides with small angles on the top and bottom and wider angles on the sides.",
            "vi": "Kim cương được định nghĩa là một khoáng chất tinh thể không màu, rất cứng, được làm bằng cacbon nguyên chất, hoặc một hình có bốn cạnh bằng nhau với các góc nhỏ ở trên và dưới và các góc rộng hơn ở các cạnh."
        },
        {
            "pos": "adjective",
            "en": "The definition of diamond is set with a diamond, or marking a 60th or 75th year.",
            "vi": "Định nghĩa về kim cương được đặt bằng một viên kim cương, hoặc đánh dấu năm thứ 60 hoặc 75."
        },
        {
            "pos": "verb",
            "en": "Diamond means to adorn with this mineral.",
            "vi": "Kim cương có nghĩa là để tô điểm bằng khoáng chất này."
        },
        {
            "pos": "pronoun",
            "en": "A female given name of modern usage, from the name of the gem.",
            "vi": "Một tên phụ nữ được sử dụng hiện đại, từ tên của đá quý."
        },
        {
            "pos": "idiom",
            "en": "diamond in the rough  One having exceptionally good qualities or the potential for greatness but lacking polish and refinement.",
            "vi": "kim cương ở dạng thô Một có những phẩm chất đặc biệt tốt hoặc tiềm năng vĩ đại nhưng thiếu đánh bóng và tinh luyện."
        }
    ],
    "sentences": [
        {
            "en": "A diamond is the hardest, most resilient, most beautiful gem of all.",
            "vi": "Viên kim cương là loại đá quý cứng nhất, đàn hồi nhất, đẹp nhất."
        },
        {
            "en": "Inside sparkled a diamond choker with an unusually worn, plain charm of a half-sun, half-moon pierced by an arrow.",
            "vi": "Bên trong lấp lánh một chiếc vòng cổ bằng kim cương với một viên kim cương bị mài mòn bất thường, có hình một nửa mặt trời, nửa mặt trăng bị một mũi tên đâm xuyên qua."
        }
    ],
    "words_form": [
        "diamonds"
    ],
    "meaning_vi": "Hình thoi( kim cương)"
}