{
    "spelling": [
        "/ɪnˈθjuːzɪæst/"
    ],
    "synonyms": [
        "addict",
        "admirer",
        "aficionado",
        "believer",
        "buff"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "One who is filled with enthusiasm; one who is ardently absorbed in an interest or pursuit.",
            "vi": "Quyến rũ; hấp dẫn."
        },
        {
            "pos": "",
            "en": "With regard to technology, an enthusiast is a person who enjoys using computers and electronic equipment. Enthusiasts are willing to learn more of the ins and outs of a product than the average consumer, who just wants to use it. An enthusiast is more like a \"prosumer.\" See high-tech people, consumer and prosumer.",
            "vi": "Trình bày phân từ của sự tham gia."
        }
    ],
    "sentences": [
        {
            "en": "Whilst the worship of the Church of England was proscribed, every illiterate or frenzied enthusiast was allowed to harangue at his pleasure.",
            "vi": "Trong khi việc tôn thờ Nhà thờ Anh bị đình chỉ, mọi người mù chữ hoặc cuồng tín đều được phép hành động theo ý thích của mình."
        },
        {
            "en": "He was an enthusiast in music and other fine arts; and he habitually practised as an amusement, while deeply studying in theory, all sorts of athletic sports, including swimming and fencing.",
            "vi": "Anh ấy là một người đam mê âm nhạc và các môn nghệ thuật khác; và anh ấy thường tập luyện như một trò giải trí, đồng thời nghiên cứu sâu về lý thuyết, tất cả các môn thể thao rèn luyện sức khỏe, bao gồm cả bơi lội và đấu kiếm."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "One who is filled with enthusiasm; one who is ardently absorbed in an interest or pursuit.",
            "vi": "Quyến rũ; hấp dẫn."
        },
        {
            "pos": "",
            "en": "With regard to technology, an enthusiast is a person who enjoys using computers and electronic equipment. Enthusiasts are willing to learn more of the ins and outs of a product than the average consumer, who just wants to use it. An enthusiast is more like a \"prosumer.\" See high-tech people, consumer and prosumer.",
            "vi": "Trình bày phân từ của sự tham gia."
        }
    ]
}