{
    "spelling": [
        "/frɔɡ/",
        "/frɑɡ/"
    ],
    "synonyms": [
        "batrachian",
        "bullfrog",
        "toad",
        "irritation",
        "catch"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The definition of a frog is an amphibian with no tail, strong legs, short arms, smooth skin and webbed feet, or a triangular pad on a horse's foot, or a device to hold flower stems in an arrangement.",
            "vi": "Định nghĩa về ếch là động vật lưỡng cư không có đuôi, chân khỏe, tay ngắn, da mịn và bàn chân có màng, hoặc một miếng đệm hình tam giác trên bàn chân ngựa, hoặc một thiết bị để giữ các cành hoa theo cách sắp xếp."
        },
        {
            "pos": "verb",
            "en": "To hunt or trap frogs.",
            "vi": "Để săn hoặc bẫy ếch."
        },
        {
            "pos": "idiom",
            "en": "have a frog in one's throat  to experience temporary hoarseness",
            "vi": "ngậm một con ếch trong cổ họng để bị khàn tiếng tạm thời"
        }
    ],
    "sentences": [
        {
            "en": "The perfect frog, after transformation, is smaller than the larva.",
            "vi": "Con ếch hoàn hảo sau khi biến đổi sẽ nhỏ hơn ấu trùng."
        },
        {
            "en": "The importance of the osmotic pressure of sea-water in biology will be easily understood from the fact that a frog placed in sea-water loses water by exosmosis and soon becomes 20% lighter than its original weight, while a true salt-water fish suddenly transferred to fresh water gains water by endosmosis, swells up and quickly succumbs.",
            "vi": "Tầm quan trọng của áp suất thẩm thấu của nước biển trong sinh học sẽ dễ dàng hiểu được từ thực tế là một con ếch được đặt trong nước biển bị mất nước do thải nước và nhanh chóng trở nên nhẹ hơn 20% so với trọng lượng ban đầu của nó, trong khi một con cá nước mặn thực sự đột nhiên chuyển sang nước ngọt lấy nước theo đường nội soi, trương lên và nhanh chóng không qua khỏi."
        }
    ],
    "words_form": [
        "frogs"
    ],
    "meaning_vi": "ếch"
}