{
    "spelling": [
        "/ˈɪnəsənt/"
    ],
    "synonyms": [
        "guileless",
        "guiltless",
        "impeccable",
        "pure",
        "clean"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Innocent is defined as free from sin, guilt or wrongdoing.",
            "vi": "Vô tội được định nghĩa là không có tội lỗi, tội lỗi hoặc hành động sai trái."
        },
        {
            "pos": "noun",
            "en": "A very young child.",
            "vi": "Một đứa trẻ còn rất nhỏ."
        },
        {
            "pos": "proper name",
            "en": "(person) (born Sinibaldo de' Fieschi) Died 1254; pope (1243-54)",
            "vi": "(người) (sinh ra là Sinibaldo de 'Fieschi) Chết 1254; giáo hoàng (1243-54)"
        },
        {
            "pos": "idiom",
            "en": "the (Holy) Innocents  those children of Bethlehem slaughtered by King Herod: Matt. 2:16",
            "vi": "(Thánh) Vô tội những đứa trẻ của Bết-lê-hem bị Vua Hê-rốt tàn sát: Matt. 2:16"
        }
    ],
    "sentences": [
        {
            "en": "The children are so innocent they will believe anything I tell them.",
            "vi": "Những đứa trẻ rất ngây thơ, chúng sẽ tin bất cứ điều gì tôi nói với chúng."
        },
        {
            "en": "He was the same as ever, but the feverish color of his face, his glittering eyes rapturously turned toward her, and especially his neck, delicate as a child's, revealed by the turn-down collar of his shirt, gave him a peculiarly innocent, childlike look, such as she had never seen on him before.",
            "vi": "Anh vẫn như ngày nào, nhưng sắc mặt phát sốt, đôi mắt long lanh say mê hướng về phía cô, và đặc biệt là chiếc cổ của anh, thanh tú như một đứa trẻ, lộ ra qua cổ áo sơ mi quay xuống, tạo cho anh một vẻ ngây thơ đặc biệt, cái nhìn như trẻ con, chẳng hạn như cô chưa từng thấy ở anh trước đây."
        }
    ],
    "words_form": [
        "innocents"
    ],
    "meaning_vi": "vô tội"
}