{
    "spelling": [
        "/ɪnˈsaɪdə/"
    ],
    "synonyms": [
        "abettor",
        "accomplice",
        "aid",
        "aide",
        "assistant"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "An accepted member of a group.",
            "vi": "Hành động tiêm chích."
        },
        {
            "pos": "",
            "en": "Someone who knows about important information before it becomes public. An insider may be an employee, a company director, someone who works closely with the company, or someone who owns at least 10 percent of the company. Insiders, including their friends and family members, are prohibited from trading on inside information that has not yet been announced to the public.",
            "vi": "Một chất được đưa vào cơ thể, đặc biệt là qua ống tiêm dưới da, dưới dạng chất lỏng vào tĩnh mạch hoặc cơ của cơ thể."
        }
    ],
    "sentences": [
        {
            "en": "Many people initially question the expense of hiring a planner on top of other party costs, but bear in mind that planners frequently have access to bulk discounts and insider deals that are not available to hosts.",
            "vi": "Ban đầu, nhiều người đặt câu hỏi về chi phí thuê người lập kế hoạch trên chi phí của bên khác, nhưng hãy nhớ rằng những người lập kế hoạch thường có quyền truy cập vào chiết khấu hàng loạt và các giao dịch nội bộ không có sẵn cho người dẫn chương trình."
        },
        {
            "en": "Wouldn't it be great if you could learn all the insider secrets of top web copywriters for you to use yourself?",
            "vi": "Sẽ không tuyệt vời nếu bạn có thể tìm hiểu tất cả những bí mật nội bộ của những người viết quảng cáo web hàng đầu để bạn tự sử dụng phải không?"
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "An accepted member of a group.",
            "vi": "Hành động tiêm chích."
        },
        {
            "pos": "",
            "en": "Someone who knows about important information before it becomes public. An insider may be an employee, a company director, someone who works closely with the company, or someone who owns at least 10 percent of the company. Insiders, including their friends and family members, are prohibited from trading on inside information that has not yet been announced to the public.",
            "vi": "Một chất được đưa vào cơ thể, đặc biệt là qua ống tiêm dưới da, dưới dạng chất lỏng vào tĩnh mạch hoặc cơ của cơ thể."
        }
    ]
}