{
    "spelling": [
        "/dʒæz/"
    ],
    "synonyms": [
        "bop",
        "dixieland",
        "ragtime",
        "boogie-woogie",
        "blues"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A kind of music, originally improvised but now also arranged, characterized by syncopation, rubato, usually heavily accented rhythms, dissonances, individualized melodic variations, and unusual tonal effects on the trumpet, trombone, clarinet, saxophone, etc.: it originated with Southern blacks in the late 19th cent.",
            "vi": "Một loại âm nhạc, ban đầu là ngẫu hứng nhưng bây giờ cũng được sắp xếp, đặc trưng bởi đảo phách, rubato, nhịp điệu thường có trọng âm cao, sự bất hòa, các biến thể giai điệu cá nhân và hiệu ứng âm sắc bất thường trên kèn trumpet, trombone, clarinet, saxophone, v.v.: nó có nguồn gốc từ miền Nam người da đen vào cuối 19 xu."
        },
        {
            "pos": "verb",
            "en": "To speed up.",
            "vi": "Để tăng tốc độ."
        },
        {
            "pos": "pronoun",
            "en": "A diminutive of the male given name James.",
            "vi": "Một chi tiết nhỏ của người đàn ông được đặt tên James."
        },
        {
            "pos": "adjective",
            "en": "Of, in, like, or having to do with jazz.",
            "vi": "Tất nhiên, giống như, hoặc liên quan đến nhạc jazz."
        },
        {
            "pos": "idiom",
            "en": "and all that jazz  and so forth; et cetera",
            "vi": "và tất cả nhạc jazz đó, v.v.; vân vân"
        }
    ],
    "sentences": [
        {
            "en": "Patience wasn't his strong suit and Mrs. Lincoln and jazz music somehow weren't sufficient evening entertainment.",
            "vi": "Sự kiên nhẫn không phải là bộ đồ mạnh mẽ của anh ấy và bà Lincoln và nhạc jazz bằng cách nào đó không phải là thứ giải trí buổi tối đầy đủ."
        },
        {
            "en": "Enjoy your meal accompanied by live jazz music every evening.",
            "vi": "Thưởng thức bữa ăn của bạn với nhạc jazz sống vào mỗi buổi tối."
        }
    ],
    "words_form": [
        "jazzes"
    ],
    "meaning_vi": "nhạc jazz"
}