{
    "spelling": [
        "/ˈlɛvəl/"
    ],
    "synonyms": [
        "uninterrupted",
        "rung",
        "uniform",
        "same",
        "trim"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Being on a horizontal plane.",
            "vi": "Nằm trên một mặt phẳng nằm ngang."
        },
        {
            "pos": "noun",
            "en": "An instrument for determining, or adjusting a surface to, an even horizontal plane: the traditional level has a clear tube partly filled with liquid so as to leave an air bubble that moves to the exact center of the tube when the instrument is on an even horizontal plane; often there is another such tube which indicates when the instrument is perpendicular to the horizontal.",
            "vi": "Một thiết bị để xác định hoặc điều chỉnh bề mặt thành mặt phẳng ngang đều: mức truyền thống có một ống trong suốt chứa một phần chất lỏng để tạo ra một bong bóng khí di chuyển đến tâm chính xác của ống khi thiết bị nằm trên mặt phẳng. mặt phẳng nằm ngang; thường có một ống khác như vậy cho biết khi nào dụng cụ vuông góc với phương ngang."
        },
        {
            "pos": "verb",
            "en": "(informal) To be frank and open.",
            "vi": "(không chính thức) Thẳng thắn và cởi mở."
        },
        {
            "pos": "adverb",
            "en": "Along a flat or even line or plane.",
            "vi": "Dọc theo một đường thẳng hoặc mặt phẳng phẳng hoặc đều."
        },
        {
            "pos": "idiom",
            "en": "(one's) level best  The best one can do in an earnest attempt: I did my level best in math class.",
            "vi": "Mức tốt nhất của (một người) Điều tốt nhất có thể làm trong một nỗ lực nghiêm túc: Tôi đã làm tốt nhất trình độ của mình trong lớp toán."
        }
    ],
    "sentences": [
        {
            "en": "The carpenters tried to keep the dust level down, but it was impossible to avoid all of it.",
            "vi": "Những người thợ mộc đã cố gắng giữ cho mức bụi giảm xuống, nhưng không thể tránh được tất cả."
        },
        {
            "en": "She gave him a level look.",
            "vi": "Cô ấy đã cho anh ta một cái nhìn bình đẳng."
        }
    ],
    "words_form": [
        "leveled",
        "leveling",
        "levelled",
        "levelling",
        "levels"
    ],
    "meaning_vi": "cấp bậc"
}