{
    "spelling": [
        "/ˈlɪdər/"
    ],
    "synonyms": [
        "offspring",
        "garbage",
        "rubbish",
        "cleanliness",
        "confuse"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "Litter is defined as trash or garbage that is not disposed of properly and that is left laying where it doesn't belong.",
            "vi": "Rác thải được định nghĩa là thùng rác hoặc rác không được xử lý đúng cách và bị bỏ lại nơi không thuộc về."
        },
        {
            "pos": "verb",
            "en": "To give birth to (a litter).",
            "vi": "Để sinh (một lứa)."
        },
        {
            "pos": "idiom",
            "en": "the pick of the litter  the best or most desirable puppy, kitten, etc. of a single litter",
            "vi": "việc chọn một con chó con, mèo con, v.v. tốt nhất hoặc đáng mong đợi nhất trong một lứa"
        }
    ],
    "sentences": [
        {
            "en": "The Mahmal, a kind of covered litter, first originated by Queen Sheger-ed-Dur, is brought into the city in procession, though not with as much pomp as when it leaves with the pilgrims. These and other processions have lost much of their effect since the extinction of the Mamelukes, and the gradual disuse of gorgeous dress for the retainers of the,, officers of state.",
            "vi": "Mahmal, một loại rác có mái che, xuất phát đầu tiên bởi Nữ hoàng Sheger-ed-Dur, được đưa vào thành phố trong đám rước, mặc dù không nhiều như khi nó rời đi cùng những người hành hương. Những đám rước này và những đám rước khác đã mất đi nhiều tác dụng kể từ khi Mamelukes tuyệt chủng, và việc các thuộc hạ của các sĩ quan nhà nước dần dần không còn ăn mặc lộng lẫy nữa."
        },
        {
            "en": "It is good that you have a separate litter box for each cat.",
            "vi": "Tốt là bạn nên có một hộp vệ sinh riêng cho mỗi con mèo."
        }
    ],
    "words_form": [
        "littered",
        "littering",
        "litters"
    ],
    "meaning_vi": "xả rác"
}