{
    "spelling": [
        "/ˈlɪvər/"
    ],
    "synonyms": [
        "exocrine",
        "digestive",
        "adrenal",
        "renal",
        "bone-marrow"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The liver is defined as an organ in the body that secretes bile to help digest carbos, fats and proteins.",
            "vi": "Gan được định nghĩa là một cơ quan trong cơ thể tiết ra mật để giúp tiêu hóa cacbos, chất béo và protein."
        },
        {
            "pos": "adjective",
            "en": "The definition of liver is made with this organ or of the same color as this organ.",
            "vi": "Định nghĩa về gan được tạo ra từ cơ quan này hoặc cùng màu với cơ quan này."
        }
    ],
    "sentences": [
        {
            "en": "Doctors came to see her singly and in consultation, talked much in French, German, and Latin, blamed one another, and prescribed a great variety of medicines for all the diseases known to them, but the simple idea never occurred to any of them that they could not know the disease Natasha was suffering from, as no disease suffered by a live man can be known, for every living person has his own peculiarities and always has his own peculiar, personal, novel, complicated disease, unknown to medicine--not a disease of the lungs, liver, skin, heart, nerves, and so on mentioned in medical books, but a disease consisting of one of the innumerable combinations of the maladies of those organs.",
            "vi": "Các bác sĩ đã đến gặp cô ấy một mình và tư vấn, nói chuyện nhiều bằng tiếng Pháp, Đức và Latinh, đổ lỗi cho nhau và kê nhiều loại thuốc cho tất cả các bệnh mà họ biết, nhưng ý tưởng đơn giản chưa bao giờ xảy ra với bất kỳ ai trong số họ họ không thể biết được căn bệnh mà Natasha đang mắc phải, cũng như không có căn bệnh nào mà người sống mắc phải, vì mỗi người sống đều có những đặc thù riêng và luôn có những căn bệnh đặc biệt, riêng tư, mới lạ, phức tạp mà y học chưa biết đến-- không phải là bệnh về phổi, gan, da, tim, thần kinh, vân vân được đề cập trong sách y học, mà là bệnh bao gồm một trong vô số tổ hợp bệnh tật của các cơ quan đó."
        },
        {
            "en": "The liver opens by two ducts into the digestive FIG.",
            "vi": "Gan mở bởi hai ống dẫn vào hình tiêu hóa."
        }
    ],
    "words_form": [],
    "meaning_vi": "gan"
}