{
    "spelling": [
        "/ˈmeɪkʌp/"
    ],
    "synonyms": [
        "composition",
        "construction",
        "style",
        "constitution",
        "formation"
    ],
    "meaning": [
        {
            "pos": "verb",
            "en": "To compensate, fill in or catch up.",
            "vi": "Để bù đắp, hãy điền vào hoặc bắt kịp."
        },
        {
            "pos": "noun",
            "en": "Alternative spelling of makeup. See usage notes there.",
            "vi": "Cách viết khác của trang điểm. Xem ghi chú sử dụng ở đó."
        },
        {
            "pos": "adjective",
            "en": "Made-up, false, imaginary, fabricated.",
            "vi": "Bịa đặt, giả dối, tưởng tượng, bịa đặt."
        }
    ],
    "sentences": [
        {
            "en": "No matter how sorry Alex was for what happened, or how many times he apologized or tried to make up for it, he couldn't remove the hurt.",
            "vi": "Dù Alex có xin lỗi về những gì đã xảy ra hay bao nhiêu lần anh ấy xin lỗi hay cố gắng bù đắp, anh ấy cũng không thể xóa bỏ sự tổn thương."
        },
        {
            "en": "Prodigies of valour on the part of Bayezid's troops could not make up for the defection of the newly-absorbed levies from Aidin, Sarukhan and Menteshe who went over to their former princes in Timur's camp. The rout of the Turkish army was complete.",
            "vi": "Những thần đồng dũng cảm trong đội quân của Bayezid không thể bù đắp cho việc đào tẩu những khoản tiền mới được hấp thụ từ Aidin, Sarukhan và Menteshe, những người đã đến gặp các hoàng tử cũ của họ trong trại của Timur. Cuộc hành quân của quân đội Thổ Nhĩ Kỳ đã hoàn tất."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "verb",
            "en": "To compensate, fill in or catch up.",
            "vi": "Để bù đắp, hãy điền vào hoặc bắt kịp."
        },
        {
            "pos": "noun",
            "en": "Alternative spelling of makeup. See usage notes there.",
            "vi": "Cách viết khác của trang điểm. Xem ghi chú sử dụng ở đó."
        },
        {
            "pos": "adjective",
            "en": "Made-up, false, imaginary, fabricated.",
            "vi": "Bịa đặt, giả dối, tưởng tượng, bịa đặt."
        }
    ]
}