{
    "spelling": [
        "/mæn/"
    ],
    "synonyms": [
        "humankind",
        "hombre",
        "beau",
        "boy",
        "blade"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The human race; mankind.",
            "vi": "Loài người; loài người."
        },
        {
            "pos": "verb",
            "en": "To supply with staff or crew (of either sex).",
            "vi": "Cung cấp với nhân viên hoặc phi hành đoàn (của một trong hai giới tính)."
        },
        {
            "pos": "interjection",
            "en": "Used as an expletive to indicate intense feeling.",
            "vi": "Được sử dụng như một lời giải thích để biểu thị cảm giác mãnh liệt."
        },
        {
            "pos": "abbreviation",
            "en": "Manitoba.",
            "vi": "Manitoba."
        },
        {
            "pos": "adjective",
            "en": "Male.",
            "vi": "Nam giới."
        },
        {
            "pos": "proper name",
            "en": "(place) One of the British Isles, between Northern Ireland & England: 221 sq mi (572 sq km); cap. Douglas.",
            "vi": "(địa điểm) Một trong những Quần đảo Anh, giữa Bắc Ireland và Anh: 221 sq mi (572 sq km); mũ lưỡi trai. Douglas."
        },
        {
            "pos": "affix",
            "en": "Man or person of a (specified) kind, in a (specified) activity, etc.",
            "vi": "Người đàn ông hoặc con người thuộc loại (cụ thể), trong một hoạt động (cụ thể), v.v."
        },
        {
            "pos": "idiom",
            "en": "as one man  In complete agreement; unanimously. With no exception: They objected as one man.",
            "vi": "như một người đàn ông Hoàn toàn đồng ý; nhất trí. Không có ngoại lệ: Họ phản đối như một người đàn ông."
        }
    ],
    "sentences": [
        {
            "en": "The little man shook his bald head.",
            "vi": "Người đàn ông nhỏ bé lắc đầu hói."
        },
        {
            "en": "He didn't look like a rich man, but then, what did a rich man look like?",
            "vi": "Anh ta trông không giống một người giàu có, nhưng sau đó, một người giàu trông như thế nào?"
        }
    ],
    "words_form": [
        "manned",
        "manning",
        "mans",
        "men"
    ],
    "meaning_vi": "Đàn ông"
}