{
    "spelling": [
        "/mɔr/"
    ],
    "synonyms": [
        "stronger",
        "aggrandized",
        "longer",
        "higher",
        "massed"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A greater or additional quantity, number, degree, or amount.",
            "vi": "Số lượng, số lượng, độ hoặc số lượng lớn hơn hoặc bổ sung."
        },
        {
            "pos": "pronoun",
            "en": "More means a larger amount or greater number of things.",
            "vi": "Nhiều hơn có nghĩa là số lượng lớn hơn hoặc số lượng nhiều hơn."
        },
        {
            "pos": "adverb",
            "en": "More is defined as something done again, or something that is done or felt to a larger extent.",
            "vi": "Nhiều hơn được định nghĩa là một cái gì đó được thực hiện lại hoặc một cái gì đó đã được thực hiện hoặc cảm nhận ở một mức độ lớn hơn."
        },
        {
            "pos": "proper name",
            "en": "(person) 1478-1535; Eng. statesman & writer: executed: canonized in 1935",
            "vi": "(người) 1478-1535; Anh chính khách & nhà văn: bị hành quyết: được phong thánh năm 1935"
        },
        {
            "pos": "adjective",
            "en": "Greater in amount, degree, or number.",
            "vi": "Nhiều hơn về số lượng, mức độ hoặc số lượng."
        },
        {
            "pos": "determiner",
            "en": "Comparative form of many: in greater number. (Used for a discrete quantity.)",
            "vi": "Dạng so sánh của nhiều: với số lượng nhiều hơn. (Được sử dụng cho một số lượng rời rạc.)"
        },
        {
            "pos": "suffix",
            "en": "Used for placenames.",
            "vi": "Được sử dụng cho tên địa điểm."
        },
        {
            "pos": "verb",
            "en": "To root up.",
            "vi": "Để root up."
        },
        {
            "pos": "idiom",
            "en": "more and more  To a steadily increasing extent or degree: Getting more and more worried.",
            "vi": "ngày càng nhiều Ở mức độ hoặc mức độ tăng dần đều: Ngày càng lo lắng hơn."
        }
    ],
    "sentences": [
        {
            "en": "Flying cars, faster cars, more features in cars, we all get that.",
            "vi": "Ô tô bay, ô tô nhanh hơn, nhiều tính năng hơn trên ô tô, tất cả chúng ta đều nhận được điều đó."
        },
        {
            "en": "Think no more about it, he said.",
            "vi": "Không cần suy nghĩ về nó nữa, anh ấy nói."
        }
    ],
    "words_form": [],
    "meaning_vi": "hơn"
}