{
    "spelling": [
        "/ˌnævɪˈgeɪʃən/"
    ],
    "synonyms": [
        "boating",
        "exploration",
        "shipping",
        "aeronautics",
        "captaincy"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The science of locating the position and plotting the course of ships and aircraft.",
            "vi": "Khoa học xác định vị trí và lập kế hoạch của tàu và máy bay."
        },
        {
            "pos": "",
            "en": "(1) Moving around. It refers to clicking or tapping buttons and menus or making multi-finger gestures to activate functions in an application or to jump to other sections of a website. See navigation bar and imagemap.",
            "vi": "(1) Di chuyển xung quanh. Nó đề cập đến việc nhấp hoặc chạm vào các nút và menu hoặc thực hiện các cử chỉ bằng nhiều ngón tay để kích hoạt các chức năng trong một ứng dụng hoặc để chuyển đến các phần khác của trang web. Xem thanh điều hướng và bản đồ hình ảnh."
        }
    ],
    "sentences": [
        {
            "en": "The soldier touched his thumb to the navigation control board.",
            "vi": "Người lính chạm ngón tay cái vào bảng điều khiển dẫn đường."
        },
        {
            "en": "The rugged Spanish coast is indented by many fjord-like inlets, especially in the west, where navigation is sometimes difficult and dangerous; but its rivers are comparatively unimportant.",
            "vi": "Bờ biển Tây Ban Nha gồ ghề bị thụt vào bởi nhiều cửa gió giống vịnh hẹp, đặc biệt là ở phía tây, nơi hàng hải đôi khi khó khăn và nguy hiểm; nhưng các con sông của nó tương đối không quan trọng."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "The science of locating the position and plotting the course of ships and aircraft.",
            "vi": "Khoa học xác định vị trí và lập kế hoạch của tàu và máy bay."
        },
        {
            "pos": "",
            "en": "(1) Moving around. It refers to clicking or tapping buttons and menus or making multi-finger gestures to activate functions in an application or to jump to other sections of a website. See navigation bar and imagemap.",
            "vi": "(1) Di chuyển xung quanh. Nó đề cập đến việc nhấp hoặc chạm vào các nút và menu hoặc thực hiện các cử chỉ bằng nhiều ngón tay để kích hoạt các chức năng trong một ứng dụng hoặc để chuyển đến các phần khác của trang web. Xem thanh điều hướng và bản đồ hình ảnh."
        }
    ]
}