{
    "spelling": [
        "/ˈɔːgənaɪzə/"
    ],
    "synonyms": [
        "coordinator",
        "designer",
        "developer",
        "promoter",
        "arranger"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "(embryology) Any portion of a developing embryo, or any substance produced by it, capable of inducing differentiation in other portions.",
            "vi": "(phôi thai học) Bất kỳ phần nào của phôi đang phát triển, hoặc bất kỳ chất nào do nó tạo ra, có khả năng tạo ra sự khác biệt trong các phần khác."
        },
        {
            "pos": "",
            "en": "(1) Software that provides a calendar, to-do list and other daily management tools.",
            "vi": "(1) Phần mềm cung cấp lịch, danh sách việc cần làm và các công cụ quản lý hàng ngày khác."
        }
    ],
    "sentences": [
        {
            "en": "Omar was the great organizer of Arabian affairs.",
            "vi": "Omar là người tổ chức tuyệt vời các công việc của Ả Rập."
        },
        {
            "en": "The Corniche road was improved; and public works in various parts of Piedmont, and the Cisalpine and Ligurian Republics attested the foresight and wisdom of the great organizer of industry and quickener of human energies.",
            "vi": "Con đường Corniche đã được cải thiện; và các công trình công cộng ở các vùng khác nhau của Piedmont, và các nước Cộng hòa Cisalpine và Ligurian đã chứng minh tầm nhìn xa và sự khôn ngoan của nhà tổ chức vĩ đại của ngành công nghiệp và người khai thác nhanh năng lượng của con người."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "(embryology) Any portion of a developing embryo, or any substance produced by it, capable of inducing differentiation in other portions.",
            "vi": "(phôi thai học) Bất kỳ phần nào của phôi đang phát triển, hoặc bất kỳ chất nào do nó tạo ra, có khả năng tạo ra sự khác biệt trong các phần khác."
        },
        {
            "pos": "",
            "en": "(1) Software that provides a calendar, to-do list and other daily management tools.",
            "vi": "(1) Phần mềm cung cấp lịch, danh sách việc cần làm và các công cụ quản lý hàng ngày khác."
        }
    ]
}