{
    "spelling": [
        "/pæn/"
    ],
    "synonyms": [
        "criticize",
        "container",
        "blame",
        "censure",
        "knock"
    ],
    "meaning": [
        {
            "pos": "prefix",
            "en": "Pan is defined as all.",
            "vi": "Pan được định nghĩa là tất cả."
        },
        {
            "pos": "verb",
            "en": "To wash gravel in a pan, searching for gold.",
            "vi": "Để rửa sỏi trong chảo, tìm vàng."
        },
        {
            "pos": "noun",
            "en": "The definition of a pan is a container used for cooking. It can also refer to a certain amount of an item which a pan will hold.",
            "vi": "Định nghĩa của chảo là một vật chứa được sử dụng để nấu ăn. Nó cũng có thể đề cập đến một số lượng vật phẩm nhất định mà chảo sẽ chứa."
        },
        {
            "pos": "abbreviation",
            "en": "Panama.",
            "vi": "Panama."
        },
        {
            "pos": "affix",
            "en": "All.",
            "vi": "Tất cả các."
        },
        {
            "pos": "adjective",
            "en": "(slang) Pansexual.",
            "vi": "(tiếng lóng) Pansexual."
        },
        {
            "pos": "anagrams",
            "en": "Nap.",
            "vi": "Ngủ trưa."
        },
        {
            "pos": "idiom",
            "en": "pan out  to yield gold, as gravel, a mine, etc. to turn out (as specified); transpire; esp., to turn out well; succeed",
            "vi": "xoay ra để mang lại vàng, như sỏi, một cái mỏ, v.v. để quay ra (như đã chỉ định); chuyển tuyến; đặc biệt, hóa ra tốt; thành công"
        }
    ],
    "sentences": [
        {
            "en": "The best form of stove is that with which perfect combustion is most nearly attained, and to which a pan of water is affixed to supply a desirable humidity to the air, the gas having the effect of drying the atmosphere.",
            "vi": "Hình thức bếp tốt nhất là loại bếp gần như đạt được sự đốt cháy hoàn hảo nhất và có một chảo nước được gắn vào để cung cấp độ ẩm mong muốn cho không khí, khí có tác dụng làm khô bầu không khí."
        },
        {
            "en": "Sarah entered the room carrying a pan of steaming biscuits.",
            "vi": "Sarah bước vào phòng mang theo một chảo bánh quy đang bốc khói."
        }
    ],
    "words_form": [
        "panned",
        "panning",
        "pans"
    ],
    "meaning_vi": "chảo"
}