{
    "spelling": [
        "/ˌrɛfju(ː)ˈʤiː/"
    ],
    "synonyms": [
        "alien",
        "displaced person",
        "emigrant",
        "evacuee",
        "exile"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "One who flees, especially to another country, seeking refuge from war, political oppression, religious persecution, or a natural disaster.",
            "vi": "Một người chạy trốn, đặc biệt là đến một quốc gia khác, tìm nơi ẩn náu sau chiến tranh, áp bức chính trị, đàn áp tôn giáo, hoặc một thảm họa thiên nhiên."
        },
        {
            "pos": "verb",
            "en": "(US, historical) To convey (slaves) away from the advance of the federal forces.",
            "vi": "(Mỹ, lịch sử) Để vận chuyển (nô lệ) khỏi sự tiến công của lực lượng liên bang."
        }
    ],
    "sentences": [
        {
            "en": "He also conquered the land of Asnunnak and carried off from Padan a stela belonging to a refugee from Malatia.",
            "vi": "Ông cũng chinh phục vùng đất Asnunnak và mang về từ Padan một tấm bia của một người tị nạn từ Malatia."
        },
        {
            "en": "Gouverneur Morris's father, Lewis Morris (1698-1762), closed a long public career as judge of the vice-admiralty court of New York; his mother was descended from a French Protestant refugee, who had come to America to escape the persecution of Louis XIV.",
            "vi": "Cha của Gouverneur Morris, Lewis Morris (1698-1762), đã khép lại một sự nghiệp công khai lâu dài với tư cách là thẩm phán của tòa án phó đô đốc New York; mẹ của ông là hậu duệ của một người Pháp tị nạn Tin lành, người đã đến Mỹ để thoát khỏi cuộc đàn áp của Louis XIV."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "One who flees, especially to another country, seeking refuge from war, political oppression, religious persecution, or a natural disaster.",
            "vi": "Một người chạy trốn, đặc biệt là đến một quốc gia khác, tìm nơi ẩn náu sau chiến tranh, áp bức chính trị, đàn áp tôn giáo, hoặc một thảm họa thiên nhiên."
        },
        {
            "pos": "verb",
            "en": "(US, historical) To convey (slaves) away from the advance of the federal forces.",
            "vi": "(Mỹ, lịch sử) Để vận chuyển (nô lệ) khỏi sự tiến công của lực lượng liên bang."
        }
    ]
}