{
    "spelling": [
        "/ˈrɒbəri/"
    ],
    "synonyms": [
        "break in",
        "burglary",
        "embezzlement",
        "felony",
        "heist"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "Act or practice of robbing.",
            "vi": "Hành động hoặc thực hành cướp."
        },
        {
            "pos": "",
            "en": "Robbery committed by a felon carrying a dangerous weapon, whether or not that weapon is actually used or even shown. The crime is tried as any robbery would be in most states, but the weapon serves to bump up the severity of the crime.",
            "vi": "Cướp của một trọng tội mang theo vũ khí nguy hiểm, cho dù vũ khí đó có thực sự được sử dụng hay không. Tội phạm được xét xử giống như bất kỳ vụ cướp nào ở hầu hết các bang, nhưng vũ khí này giúp tăng mức độ nghiêm trọng của tội phạm."
        }
    ],
    "sentences": [
        {
            "en": "Robbery and pillaging continue.",
            "vi": "Cướp bóc và cướp bóc vẫn tiếp tục."
        },
        {
            "en": "The brethren were aided in old age, sickness and poverty, often also in cases of loss by robbery, shipwreck and conflagration; for example, any member of the gild of St Catherine, Aldersgate, was to be assisted if he \"fall into poverty or be injured through age, or through fire or water, thieves or sickness.\"",
            "vi": "Các anh em được giúp đỡ khi tuổi già, bệnh tật và nghèo đói, cũng thường xảy ra các trường hợp mất mát do trộm cướp, đắm tàu ​​và hỏa hoạn; chẳng hạn, bất kỳ thành viên nào của ngôi thánh đường St Catherine, Aldersgate, sẽ được giúp đỡ nếu anh ta \"rơi vào cảnh nghèo khó hoặc bị thương do tuổi tác, hoặc do lửa hoặc nước, trộm cắp hoặc bệnh tật.\""
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "Act or practice of robbing.",
            "vi": "Hành động hoặc thực hành cướp."
        },
        {
            "pos": "",
            "en": "Robbery committed by a felon carrying a dangerous weapon, whether or not that weapon is actually used or even shown. The crime is tried as any robbery would be in most states, but the weapon serves to bump up the severity of the crime.",
            "vi": "Cướp của một trọng tội mang theo vũ khí nguy hiểm, cho dù vũ khí đó có thực sự được sử dụng hay không. Tội phạm được xét xử giống như bất kỳ vụ cướp nào ở hầu hết các bang, nhưng vũ khí này giúp tăng mức độ nghiêm trọng của tội phạm."
        }
    ]
}