{
    "spelling": [
        "/saʊnd/"
    ],
    "synonyms": [
        "harmony",
        "clank",
        "well",
        "blast",
        "quack"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "Sound is vibration in air and water that stimulate the nerves inside the ears to create the sensation of hearing.",
            "vi": "Âm thanh là sự rung động trong không khí và nước kích thích các dây thần kinh bên trong tai để tạo ra cảm giác thính giác."
        },
        {
            "pos": "adjective",
            "en": "The definition of sound is someone or something that is in good condition.",
            "vi": "Định nghĩa của âm thanh là một người nào đó hoặc một cái gì đó ở trong tình trạng tốt."
        },
        {
            "pos": "verb",
            "en": "Sound is defined as to have a particular tone or seem a certain way.",
            "vi": "Âm thanh được định nghĩa là có một giai điệu cụ thể hoặc có vẻ theo một cách nhất định."
        },
        {
            "pos": "adverb",
            "en": "Thoroughly; deeply.",
            "vi": "Triệt để; sâu sắc."
        },
        {
            "pos": "proper name",
            "en": "Öresund.",
            "vi": "Öresund."
        },
        {
            "pos": "interjection",
            "en": "(UK, slang) Yes; used to show agreement or understanding, generally without much enthusiasm.",
            "vi": "(Anh, tiếng lóng) Có; được sử dụng để thể hiện sự đồng ý hoặc hiểu biết, nói chung là không có nhiều nhiệt tình."
        },
        {
            "pos": "pronoun",
            "en": "The strait that separates Zealand (an island of Denmark) from Scania (part of Sweden); also sometimes called by the Danish name, Ã˜resund.",
            "vi": "Eo biển ngăn cách Zealand (một hòn đảo của Đan Mạch) với Scania (một phần của Thụy Điển); đôi khi cũng được gọi bằng tên Đan Mạch, Ã˜resund."
        },
        {
            "pos": "idiom",
            "en": "sound off",
            "vi": "tắt âm thanh"
        }
    ],
    "sentences": [
        {
            "en": "They heard the sound of voices behind them.",
            "vi": "Họ nghe thấy âm thanh của giọng nói đằng sau họ."
        },
        {
            "en": "A few minutes wouldn't hurt, and then he would be sound asleep.",
            "vi": "Một vài phút sẽ không đau, và sau đó anh ấy sẽ ngủ ngon."
        }
    ],
    "words_form": [
        "sounded",
        "soundest",
        "sounds"
    ],
    "meaning_vi": "âm thanh"
}