{
    "spelling": [
        "/ˈspɛʃəlaɪzd/"
    ],
    "synonyms": [
        "functional",
        "particular",
        "specially designed"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Requiring or having detailed training or expertise in a particular field.",
            "vi": "Thì quá khứ đơn và quá khứ phân từ của tình huống."
        },
        {
            "pos": "verb",
            "en": "Specialized is defined as something is more specified or directed toward a specific goal.",
            "vi": "Điều kiện trong đó một người được sở hữu như tài sản của người khác và nằm dưới sự kiểm soát của chủ sở hữu, đặc biệt là trong sự nô dịch không tự nguyện."
        }
    ],
    "sentences": [
        {
            "en": "The classification into epithelial organs, connective tissues, and the more specialized muscle and nerve, was largely due to him; and he proved the presence of neuroglia in the brain and spinal cord, discovered crystalline haematoidine, and made out the structure of the umbilical cord.",
            "vi": "Sự phân loại thành các cơ quan biểu mô, các mô liên kết, và cơ và dây thần kinh chuyên biệt hơn, phần lớn là do anh ta; và ông đã chứng minh sự hiện diện của tế bào thần kinh trong não và tủy sống, phát hiện ra haematoid kết tinh, và tạo ra cấu trúc của dây rốn."
        },
        {
            "en": "People specialized, technology advanced, and as a result, men walked on the moon.",
            "vi": "Con người chuyên môn hóa, công nghệ tiên tiến, và kết quả là, những người đàn ông đã đi bộ trên mặt trăng."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "adjective",
            "en": "Requiring or having detailed training or expertise in a particular field.",
            "vi": "Thì quá khứ đơn và quá khứ phân từ của tình huống."
        },
        {
            "pos": "verb",
            "en": "Specialized is defined as something is more specified or directed toward a specific goal.",
            "vi": "Điều kiện trong đó một người được sở hữu như tài sản của người khác và nằm dưới sự kiểm soát của chủ sở hữu, đặc biệt là trong sự nô dịch không tự nguyện."
        }
    ]
}