{
    "spelling": [
        "/ˈspɪrɪt/"
    ],
    "synonyms": [
        "soul",
        "god",
        "courage",
        "drink",
        "essence"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A supernatural being, as:  An angel or demon. A being inhabiting or embodying a particular place, object, or natural phenomenon. A fairy or sprite.",
            "vi": "Một sinh vật siêu nhiên, như: Một thiên thần hoặc ác quỷ. Một sinh vật sống hoặc hiện thân của một địa điểm, đối tượng hoặc hiện tượng tự nhiên cụ thể. Một nàng tiên hoặc thần thánh."
        },
        {
            "pos": "verb",
            "en": "To carry (away, off, etc.) secretly and swiftly, or in some mysterious way.",
            "vi": "Để thực hiện (đi, tắt, v.v.) một cách bí mật và nhanh chóng, hoặc theo một cách bí ẩn nào đó."
        },
        {
            "pos": "adjective",
            "en": "Operating by the burning of alcohol.",
            "vi": "Hoạt động bằng cách đốt cồn."
        },
        {
            "pos": "pronoun",
            "en": "The Holy Spirit: in Christian theology, the Third Person of the Blessed Trinity, the three aspects of God.",
            "vi": "Chúa Thánh Thần: trong thần học Kitô giáo, Ngôi thứ Ba của Thiên Chúa Ba Ngôi, ba khía cạnh của Thiên Chúa."
        },
        {
            "pos": "idiom",
            "en": "in spirit  furnishing inspiration or moral support, but otherwise not physically present He could not attend, but he's here with us in spirit.",
            "vi": "trong tinh thần được truyền cảm hứng hoặc hỗ trợ tinh thần, nhưng nếu không thì không có mặt về mặt thể chất."
        }
    ],
    "sentences": [
        {
            "en": "Such is the present spirit of my nation.",
            "vi": "Đó là tinh thần hiện tại của dân tộc tôi."
        },
        {
            "en": "During all the terrible winter which followed, his energy and spirit never failed him.",
            "vi": "Trong suốt mùa đông khủng khiếp sau đó, nghị lực và tinh thần của anh ấy không bao giờ khiến anh ấy thất vọng."
        }
    ],
    "words_form": [
        "spirited",
        "spirits"
    ],
    "meaning_vi": "tinh thần"
}