{
    "spelling": [
        "/sprɪŋ/"
    ],
    "synonyms": [
        "seedtime",
        "start",
        "jump",
        "give",
        "pliancy"
    ],
    "meaning": [
        {
            "pos": "verb",
            "en": "To come or arise as from some source.  To grow or develop. The plant springs from a seed.To come into existence, usually quickly. Towns sprang up.To be descended. (archaic) To begin to appear, as day; dawn.",
            "vi": "Đến hoặc phát sinh từ một số nguồn. Để tăng trưởng hoặc phát triển. Thực vật nảy sinh từ một hạt giống, thường là nhanh chóng. Các thị trấn mọc lên và đi xuống. (cổ) Để bắt đầu xuất hiện, như ngày; bình Minh."
        },
        {
            "pos": "noun",
            "en": "Spring means a source of water from the ground, particularly a very small pond.",
            "vi": "Suối có nghĩa là một nguồn nước từ lòng đất, đặc biệt là một cái ao rất nhỏ."
        },
        {
            "pos": "adjective",
            "en": "Having or supported by springs.",
            "vi": "Có hoặc được hỗ trợ bởi lò xo."
        },
        {
            "pos": "pronoun",
            "en": "Spring, the season of warmth and new vegetation following winter.",
            "vi": "Mùa xuân, mùa của sự ấm áp và thảm thực vật mới sau mùa đông."
        },
        {
            "pos": "idiom",
            "en": "spring a leak  To starting leak a fluid suddenly: The boat sprang a leak. My balloon has sprung a leak.",
            "vi": "lò xo bị rò rỉ Để bắt đầu rò rỉ chất lỏng đột ngột: Con thuyền bị rò rỉ. Quả bóng bay của tôi đã bị rò rỉ."
        }
    ],
    "sentences": [
        {
            "en": "The snow melted, leaving in its wake a harvest of spring flowers.",
            "vi": "Tuyết tan, để lại một mùa thu hoạch hoa mùa xuân."
        },
        {
            "en": "Spring is around the corner.",
            "vi": "Mùa xuân đã đến gần."
        }
    ],
    "words_form": [
        "sprang",
        "springing",
        "springs",
        "sprung"
    ],
    "meaning_vi": "mùa xuân"
}