{
    "spelling": [
        "/ˈstrʌkʧərəl/"
    ],
    "synonyms": [
        "anatomical",
        "architectural",
        "basic",
        "constitutional",
        "skeletal"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "(geol.) Of or related to the structure of the earth's crust and the changes produced in it by movement; geotectonic.",
            "vi": "Chức năng tìm kiếm trên màn hình trong Mac OS X, bắt đầu với Phiên bản 10.4. Spotlight cho phép người dùng tìm kiếm dữ liệu nằm trong hầu hết mọi loại tệp được lưu trữ trong máy tính. Spotlight cũng có thể thực hiện tìm kiếm Boolean. AND được ngụ ý bằng cách tìm kiếm nhiều từ; tuy nhiên, HOẶC có thể được phát biểu với dấu | Biểu tượng. Ví dụ, Web | Internet có nghĩa là tìm kiếm tài liệu có chứa từ \"Web\" hoặc từ \"Internet\". Theo thông lệ, để tăng tốc độ tìm kiếm trên máy tính, Mac OS X lập chỉ mục tất cả các tệp trong máy tính. Xem tìm kiếm trên máy tính để bàn."
        },
        {
            "pos": "noun",
            "en": "A part of a structure that bears a weight, or the structural piece used for such a part.",
            "vi": "Để duy trì sự ổn định của (ví dụ như máy bay hoặc tàu thủy) bằng bộ ổn định."
        }
    ],
    "sentences": [
        {
            "en": "Whilst the chances are in favour of some one homoplastic coincidence or structural agreement occurring between some member or other of a large group a and some member or other of a large group b, the matter is very different 2 a o FIG.",
            "vi": "Trong khi các cơ hội có lợi cho một sự trùng hợp ngẫu nhiên nào đó hoặc thỏa thuận cấu trúc xảy ra giữa một số thành viên hoặc thành viên khác của một nhóm lớn a và một số thành viên hoặc thành viên khác của một nhóm lớn b, thì vấn đề lại rất khác 2 FIG."
        },
        {
            "en": "There is much to be said in favour of the view entertained by some entomologists that the structural and developmental characteristics of may-flies are sufficiently peculiar to warrant the formation for them of a special order of insects, for which the names Agnatha, Plectoptera and Ephemeroptera have been proposed.",
            "vi": "Có nhiều điều để nói ủng hộ quan điểm của một số nhà côn trùng học rằng các đặc điểm cấu tạo và phát triển của ruồi may là đủ đặc biệt để đảm bảo sự hình thành cho chúng một thứ tự côn trùng đặc biệt, với tên gọi Agnatha, Plectoptera và Ephemeroptera đã được đề xuất."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "adjective",
            "en": "(geol.) Of or related to the structure of the earth's crust and the changes produced in it by movement; geotectonic.",
            "vi": "Chức năng tìm kiếm trên màn hình trong Mac OS X, bắt đầu với Phiên bản 10.4. Spotlight cho phép người dùng tìm kiếm dữ liệu nằm trong hầu hết mọi loại tệp được lưu trữ trong máy tính. Spotlight cũng có thể thực hiện tìm kiếm Boolean. AND được ngụ ý bằng cách tìm kiếm nhiều từ; tuy nhiên, HOẶC có thể được phát biểu với dấu | Biểu tượng. Ví dụ, Web | Internet có nghĩa là tìm kiếm tài liệu có chứa từ \"Web\" hoặc từ \"Internet\". Theo thông lệ, để tăng tốc độ tìm kiếm trên máy tính, Mac OS X lập chỉ mục tất cả các tệp trong máy tính. Xem tìm kiếm trên máy tính để bàn."
        },
        {
            "pos": "noun",
            "en": "A part of a structure that bears a weight, or the structural piece used for such a part.",
            "vi": "Để duy trì sự ổn định của (ví dụ như máy bay hoặc tàu thủy) bằng bộ ổn định."
        }
    ]
}