{
    "spelling": [
        "/ˈsɪnθəsəs/"
    ],
    "synonyms": [
        "constructing",
        "organization",
        "integration",
        "unification",
        "construction"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "Synthesis is defined as combining a number of different parts or ideas to come up with a new idea or theory.",
            "vi": "Tổng hợp được định nghĩa là kết hợp một số phần hoặc ý tưởng khác nhau để đưa ra một ý tưởng hoặc lý thuyết mới."
        }
    ],
    "sentences": [
        {
            "en": "Inevitably the question forces itself upon the mind, is not some fuller synthesis possible?",
            "vi": "Chắc chắn câu hỏi buộc chính nó lên tâm trí, không phải là một sự tổng hợp đầy đủ hơn nào đó có thể thực hiện được hay không?"
        },
        {
            "en": "But the belief died hard; the synthesis of urea remained isolated for many years; and many explanations were attempted by the vitalists (as, for instance, that urea was halfway between the inorganic and organic kingdoms, or that the carbon, from which it was obtained, retained the essentials of this hypothetical vital force), but only to succumb at a later date to the indubitable fact that the same laws of chemical combination prevail in both the animate and inanimate kingdoms, and that the artificial or laboratory synthesis of any substance, either inorganic or organic, is but a question of time, once its constitution is determined.'.",
            "vi": "Nhưng niềm tin đã chết cứng; quá trình tổng hợp urê vẫn bị cô lập trong nhiều năm; và nhiều lời giải thích đã được những người theo chủ nghĩa sống còn cố gắng giải thích (chẳng hạn như urê nằm giữa vương quốc vô cơ và hữu cơ, hoặc cacbon, từ đó nó thu được, giữ lại các yếu tố cần thiết của lực quan trọng giả định này), nhưng chỉ chịu thua vào một ngày sau đó với thực tế không thể chối cãi rằng các quy luật kết hợp hóa học giống nhau áp dụng trong cả vương quốc hữu hình và vô tri, và việc tổng hợp nhân tạo hoặc trong phòng thí nghiệm của bất kỳ chất nào, dù là vô cơ hay hữu cơ, chỉ là vấn đề thời gian, một khi nó đã được tạo thành được xác định.'."
        }
    ],
    "words_form": [
        "syntheses"
    ],
    "meaning_vi": "tổng hợp"
}