{
    "spelling": [
        "/ˈtæktək(ə)l/"
    ],
    "synonyms": [
        "attack",
        "technique",
        "strategy",
        "tactics",
        "maneuver"
    ],
    "meaning": [
        {
            "pos": "adjective",
            "en": "Relating to, using, or involving tactics, especially in military or naval operations, and often in contrast to strategy.",
            "vi": "Liên quan đến, sử dụng hoặc liên quan đến các chiến thuật, đặc biệt là trong các hoạt động quân sự hoặc hải quân, và thường là trái ngược với chiến lược."
        }
    ],
    "sentences": [
        {
            "en": "A slight campaign in New Mexico took place in February 1862, in which several brilliant tactical successes were won by the Texan forces, but no permanent foothold was secured by them.",
            "vi": "Một chiến dịch nhỏ ở New Mexico diễn ra vào tháng 2 năm 1862, trong đó lực lượng Texan đã giành được một số thành công chiến thuật rực rỡ, nhưng không có chỗ đứng lâu dài nào được đảm bảo cho họ."
        },
        {
            "en": "Columns (a) and (b), forming the strongest part of the army, and also column (c) soon met with strong resistance (morning 22nd), and the country, the weather (stormy since the 20th) and tactical incidents making progress uneven, the front at nightfall of the 22nd was very sinuous, the Turks holding pronounced salients at Eski Polos, and .also at Almajik, while the Bulgarians had penetrated nearly to Kadikoi in the centre and within 2 m.",
            "vi": "Cột (a) và (b), tạo thành bộ phận mạnh nhất của quân đội, và cũng là cột (c) sớm gặp phải sự kháng cự mạnh mẽ (sáng ngày 22), và đất nước, thời tiết (bão từ ngày 20) và các sự cố chiến thuật đang diễn ra. không bằng phẳng, mặt trận vào đêm ngày 22 rất quanh co, quân Thổ Nhĩ Kỳ tổ chức những kẻ ăn mừng rõ rệt ở Eski Polos, và. cũng như ở Almajik, trong khi quân Bulgaria đã xâm nhập gần đến Kadikoi ở trung tâm và trong vòng 2 m."
        }
    ],
    "words_form": [],
    "meaning_vi": "chiến thuật"
}