{
    "spelling": [
        "/ˈtɛrərɪst/"
    ],
    "synonyms": [
        "anarchist",
        "assassin",
        "bomber",
        "fanatic",
        "guerrilla"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A person who engages in terrorism.",
            "vi": "Sau vụ tấn công ngày 11 tháng 9 năm 2001, Al-Qaeda được cho là tham gia vào các hành động khủng bố quốc tế. Để chống lại những hành vi phạm tội đó, vào ngày 20 tháng 4 năm 2005, Hoa Kỳ đã treo thưởng lên tới 5 triệu đô la cho thông tin dẫn đến việc bắt giữ hai người Canada sinh ra ở Tunisia — Abderraouf Jday (49 tuổi) và Abdelaziz Boussora (51 tuổi). Cả hai kẻ khủng bố đều bị cáo buộc có quan hệ với Al-Qaeda."
        },
        {
            "pos": "adjective",
            "en": "Of or relating to terrorism.",
            "vi": "Theo báo cáo của chính phủ, các hoạt động khủng bố dường như nhỏ xảy ra thường xuyên hơn hầu hết người dân thường nghi ngờ, nhưng những hoạt động này tương đối ít được chú ý vì một số lượng lớn các cá nhân không bị giết. Ví dụ, trong chuyến thăm của Tổng thống George W. Bush đến Canada vào đầu tháng 12 năm 2004, Hydro-Quebec đã tuyên bố rằng họ phải thắt chặt an ninh xung quanh các cơ sở chính sau khi một nhóm chống toàn cầu hóa tự xưng là “Sáng kiến ​​Kháng chiến Quốc tế” tuyên bố nhận trách nhiệm phá hoại một tháp truyền trong khu rừng phía sau của Quebec. Rõ ràng, chất nổ đã được sử dụng trong cuộc tập trận chống khủng bố tại một tòa tháp mang điện cao thế tới Mỹ. Nhóm tuyên bố hành động này là một \"cuộc biểu tình\" được thực hiện với chuyến thăm của Tổng thống Bush đến Canada, nhưng nó có khả năng gây ra cái chết và do đó có thể được coi là một hoạt động khủng bố có chủ đích. Gần đây hơn, vào tháng 6 năm 2006, một nhóm bị cáo buộc gồm 17 tên khủng bố nội gián Canada đã bị Cảnh sát Núi Hoàng gia Canada ngăn chặn âm mưu của chúng. Bởi vì kế hoạch đã được phát hiện trước bất kỳ cuộc tấn công bạo lực nào, không ai bị thương."
        }
    ],
    "sentences": [
        {
            "en": "His indignation carried him into accord for a time with those who advocated the terrorist policy.",
            "vi": "Sự phẫn nộ của ông đã khiến ông có một thời gian phù hợp với những người ủng hộ chính sách khủng bố."
        },
        {
            "en": "After the close of the Convention Tallien's political importance came to an end, for, though he sat in the Council of Five Hundred, the moderates attacked him as terrorist, and the extreme party as a renegade.",
            "vi": "Sau khi Công ước kết thúc, tầm quan trọng về chính trị của Tallien chấm dứt, vì mặc dù anh ta đã ngồi trong Hội đồng Năm Trăm, những người ôn hòa đã tấn công anh ta như một kẻ khủng bố, và đảng cực đoan là một kẻ phản bội."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "A person who engages in terrorism.",
            "vi": "Sau vụ tấn công ngày 11 tháng 9 năm 2001, Al-Qaeda được cho là tham gia vào các hành động khủng bố quốc tế. Để chống lại những hành vi phạm tội đó, vào ngày 20 tháng 4 năm 2005, Hoa Kỳ đã treo thưởng lên tới 5 triệu đô la cho thông tin dẫn đến việc bắt giữ hai người Canada sinh ra ở Tunisia — Abderraouf Jday (49 tuổi) và Abdelaziz Boussora (51 tuổi). Cả hai kẻ khủng bố đều bị cáo buộc có quan hệ với Al-Qaeda."
        },
        {
            "pos": "adjective",
            "en": "Of or relating to terrorism.",
            "vi": "Theo báo cáo của chính phủ, các hoạt động khủng bố dường như nhỏ xảy ra thường xuyên hơn hầu hết người dân thường nghi ngờ, nhưng những hoạt động này tương đối ít được chú ý vì một số lượng lớn các cá nhân không bị giết. Ví dụ, trong chuyến thăm của Tổng thống George W. Bush đến Canada vào đầu tháng 12 năm 2004, Hydro-Quebec đã tuyên bố rằng họ phải thắt chặt an ninh xung quanh các cơ sở chính sau khi một nhóm chống toàn cầu hóa tự xưng là “Sáng kiến ​​Kháng chiến Quốc tế” tuyên bố nhận trách nhiệm phá hoại một tháp truyền trong khu rừng phía sau của Quebec. Rõ ràng, chất nổ đã được sử dụng trong cuộc tập trận chống khủng bố tại một tòa tháp mang điện cao thế tới Mỹ. Nhóm tuyên bố hành động này là một \"cuộc biểu tình\" được thực hiện với chuyến thăm của Tổng thống Bush đến Canada, nhưng nó có khả năng gây ra cái chết và do đó có thể được coi là một hoạt động khủng bố có chủ đích. Gần đây hơn, vào tháng 6 năm 2006, một nhóm bị cáo buộc gồm 17 tên khủng bố nội gián Canada đã bị Cảnh sát Núi Hoàng gia Canada ngăn chặn âm mưu của chúng. Bởi vì kế hoạch đã được phát hiện trước bất kỳ cuộc tấn công bạo lực nào, không ai bị thương."
        }
    ]
}