{
    "spelling": [
        "/vaɪs/"
    ],
    "synonyms": [
        "pernicious",
        "bestiality",
        "vice-chairman",
        "licentiousness",
        "profligacy"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "A defect or flaw, as in a work of art.",
            "vi": "Một khiếm khuyết hoặc sai sót, như trong một tác phẩm nghệ thuật."
        },
        {
            "pos": "preposition",
            "en": "In the place of; as the deputy or successor of.",
            "vi": "Ở vị trí của; với tư cách là cấp phó hoặc người kế nhiệm."
        },
        {
            "pos": "affix",
            "en": "One who acts in the place of; subordinate; deputy.",
            "vi": "Một người hành động thay cho; cấp dưới; cấp phó."
        },
        {
            "pos": "verb",
            "en": "To hold or squeeze with a vice, or as if with a vice.",
            "vi": "Để giữ hoặc siết chặt với một cơ phó, hoặc như thể với một cơ phó."
        },
        {
            "pos": "adjective",
            "en": "In place of; subordinate to; designating a person below another in rank.",
            "vi": "Thay cho; phụ thuộc vào; chỉ định một người thấp hơn một người khác trong cấp bậc."
        },
        {
            "pos": "prefix",
            "en": "Someone who takes the place of someone else; a deputy.",
            "vi": "Ai đó thế chỗ cho người khác; một phó."
        }
    ],
    "sentences": [
        {
            "en": "Vice and disease, which cast such a sombre moral hue over the world, seemed to have hardly any existence for him.",
            "vi": "Phó và bệnh tật, thứ đã tạo nên một màu sắc đạo đức u ám như vậy trên thế giới, dường như hầu như không có bất kỳ sự tồn tại nào đối với anh ta."
        },
        {
            "en": "\"Where you are, there is vice and evil!\" said Pierre to his wife.",
            "vi": "\"Ngươi ở nơi nào có phó, ác độc!\" Pierre nói với vợ mình."
        }
    ],
    "words_form": [],
    "meaning_vi": "phó"
}