{
    "spelling": [
        "/wɛr/"
    ],
    "synonyms": [
        "put-on",
        "carry",
        "deteriorate",
        "pester",
        "affect"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The act of wearing or the state of being worn; use.",
            "vi": "Hành động mặc hoặc trạng thái bị mòn; sử dụng."
        },
        {
            "pos": "verb",
            "en": "To carry or have on one's person as covering, adornment, or protection.",
            "vi": "Để mang hoặc có trên người của một người như bao bọc, trang điểm hoặc bảo vệ."
        },
        {
            "pos": "proper name",
            "en": "(place) River in Durham, N England, flowing northeast into the North Sea: 67 mi (108 km)",
            "vi": "(địa điểm) Sông ở Durham, N England, chảy về phía đông bắc vào Biển Bắc: 67 mi (108 km)"
        },
        {
            "pos": "suffix",
            "en": "Used to form nouns denoting clothing worn by a particular sex (e.g. menswear) or age of person (e.g. kidswear)  On a particular part of the body (e.g. neckwear) For a particular use (e.g. daywear) Made in a particular way (eg, knitwear) or (redundantly) of a particular kind (eg, shoewear).",
            "vi": "Được sử dụng để tạo thành danh từ biểu thị quần áo mặc theo giới tính cụ thể (ví dụ: quần áo nam) hoặc tuổi của người đó (ví dụ quần áo trẻ em) Trên một bộ phận cụ thể của cơ thể (ví dụ: quần áo choàng cổ) Cho một mục đích sử dụng cụ thể (ví dụ quần áo ban ngày) Được làm theo một cách cụ thể (ví dụ: quần áo dệt kim) hoặc (dư thừa) của một loại cụ thể (ví dụ: đồ trang sức)."
        },
        {
            "pos": "idiom",
            "en": "(informal) wear the pants  To exercise controlling authority in a household.",
            "vi": "(không chính thức) mặc quần dài Để thực hiện quyền kiểm soát trong một hộ gia đình."
        }
    ],
    "sentences": [
        {
            "en": "You'd better wear a coat.",
            "vi": "Tốt hơn là bạn nên mặc một chiếc áo khoác."
        },
        {
            "en": "You could wear a feed sack at a formal dinner and not look underdressed.",
            "vi": "Bạn có thể mặc một chiếc túi đựng thức ăn trong một bữa tối trang trọng và trông không được mặc thiếu."
        }
    ],
    "words_form": [
        "wearing",
        "wears",
        "wore",
        "worn"
    ],
    "meaning_vi": "mặc"
}