{
    "spelling": [
        "/wɪdθ/"
    ],
    "synonyms": [
        "diameter",
        "girth",
        "scope",
        "span",
        "thickness"
    ],
    "meaning": [
        {
            "pos": "noun",
            "en": "The measurement of the extent of something from side to side.",
            "vi": "Để làm cho hoặc trở nên yếu hơn hoặc yếu hơn."
        }
    ],
    "sentences": [
        {
            "en": "Geologically considered, the country may be divided into three regions - a central, and the largest, comprising the whole width of the Aravalli system, formed of very old sub-metamorphic and gneissic rocks; an eastern region, with sharply defined boundary, along which the most ancient formations are abruptly replaced by the great basin of the Vindhyan strata, or are overlaid by the still more extensive spread of the Deccan trap, forming the plateau of Malwa; and a western region, of very ill-defined margin, in which, besides some rocks of undetermined age, it is more or less known or suspected that Tertiary and Secondary strata stretch across from Sind, beneath the sands of the desert, towards the flanks of the Aravallis.",
            "vi": "Xét về mặt địa chất, đất nước có thể được chia thành ba vùng - vùng trung tâm và vùng lớn nhất, bao gồm toàn bộ chiều rộng của hệ thống Aravalli, được hình thành từ các đá gneissic và phụ biến chất rất cũ; một khu vực phía đông, với ranh giới được xác định rõ ràng, cùng với đó các thành tạo cổ đại nhất bị thay thế đột ngột bởi lưu vực lớn của địa tầng Vindhyan, hoặc bị bao phủ bởi sự lan rộng hơn vẫn còn của bẫy Deccan, tạo thành cao nguyên Malwa; và một khu vực phía tây, có biên độ rất khó xác định, trong đó, ngoài một số loại đá chưa xác định được tuổi, ít nhiều người ta đã biết hoặc nghi ngờ rằng các địa tầng Đệ Tam và Thứ cấp trải dài từ Sind, bên dưới cát sa mạc, hướng về hai bên sườn của Aravallis."
        },
        {
            "en": "He had not ridden many hundred yards after that before he saw to his left, across the whole width of the field, an enormous mass of cavalry in brilliant white uniforms, mounted on black horses, trotting straight toward him and across his path.",
            "vi": "Anh ta chưa cưỡi được mấy trăm thước sau đó thì nhìn thấy ở bên trái, trên toàn bộ chiều rộng của cánh đồng, một khối lượng lớn kỵ binh trong bộ đồng phục màu trắng rực rỡ, cưỡi trên những con ngựa đen, đang chạy nước kiệu thẳng về phía anh ta và băng qua đường của anh ta."
        }
    ],
    "words_form": [],
    "meaning_vi": [
        {
            "pos": "noun",
            "en": "The measurement of the extent of something from side to side.",
            "vi": "Để làm cho hoặc trở nên yếu hơn hoặc yếu hơn."
        }
    ]
}